#Load required Library and module

In [ ]:
import pandas as pd
import numpy as np

#Load dataset

In [ ]:
Train_df=pd.read_csv('train.csv')
Test_df=pd.read_csv('test.csv')
Train_df.head()

  customer_id            name  ...  default_in_last_6months credit_card_default
0  CST_115179        ita Bose  ...                        1                   1
1  CST_121920  Alper Jonathan  ...                        0                   0
2  CST_109330     Umesh Desai  ...                        0                   0
3  CST_128288             Rie  ...                        0                   0
4  CST_151355          McCool  ...                        0                   0

[5 rows x 19 columns]

In [ ]:
Train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45528 entries, 0 to 45527
Data columns (total 19 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer_id              45528 non-null  object
 1   name                     45528 non-null  object
 2   age                      45528 non-null  int64
 3   gender                   45528 non-null  object
 4   owns_car                 44981 non-null  object
 5   owns_house               45528 non-null  object
 6   no_of_children           44754 non-null  float64
 7   net_yearly_income        45528 non-null  float64
 8   no_of_days_employed      45065 non-null  float64
 9   occupation_type          45528 non-null  object
 10  total_family_members     45445 non-null  float64
 11  migrant_worker           45441 non-null  float64
 12  yearly_debt_payments     45433 non-null  float64
 13  credit_limit             45528 non-null  float64
 14  credit_limit_used(%)     45528 non-null  int64
 15  credit_score             45520 non-null  float64
 16  prev_defaults            45528 non-null  int64
 17  default_in_last_6months  45528 non-null  int64
 18  credit_card_default      45528 non-null  int64
dtypes: float64(8), int64(5), object(6)
memory usage: 6.6+ MB

#Dataset cleaning for Train set

In [ ]:
Train_df.drop(columns=['customer_id','name'],axis=1,inplace=True)
Test_df.drop(columns=['name'],axis=1,inplace=True)

In [ ]:
Train_df.isnull().sum()

age                          0
gender                       0
owns_car                   547
owns_house                   0
no_of_children             774
net_yearly_income            0
no_of_days_employed        463
occupation_type              0
total_family_members        83
migrant_worker              87
yearly_debt_payments        95
credit_limit                 0
credit_limit_used(%)         0
credit_score                 8
prev_defaults                0
default_in_last_6months      0
credit_card_default          0
dtype: int64

In [ ]:
Train_df['credit_score'].replace(np.NaN,Train_df['credit_score'].median(),inplace=True)
Train_df['owns_house'].replace({'Y':1,'N':0},inplace=True)
Train_df['owns_car'].replace({'Y':1,'N':0},inplace=True)

In [ ]:
Train_df.fillna(0,inplace=True)

In [ ]:
Train_df.isnull().sum()

age                        0
gender                     0
owns_car                   0
owns_house                 0
no_of_children             0
net_yearly_income          0
no_of_days_employed        0
occupation_type            0
total_family_members       0
migrant_worker             0
yearly_debt_payments       0
credit_limit               0
credit_limit_used(%)       0
credit_score               0
prev_defaults              0
default_in_last_6months    0
credit_card_default        0
dtype: int64

In [ ]:
#Create a DataFrame containing all the non-numeric type features.
Train_category_df=Train_df.select_dtypes(include=['object'])
Train_category_df

      gender occupation_type
0          F         Unknown
1          M        Laborers
2          M        Laborers
3          F      Core staff
4          M      Core staff
...      ...             ...
45523      F         Unknown
45524      F     Accountants
45525      F      Core staff
45526      M        Laborers
45527      M         Unknown

[45528 rows x 2 columns]

In [ ]:
Train_dummy_df=pd.get_dummies(Train_df[Train_category_df.keys()],drop_first=True,dtype=int)
len(Train_dummy_df.keys())

20

In [ ]:
Train_df.drop(columns=Train_category_df.keys(),axis=1,inplace=True)

In [ ]:
Train_df2=pd.concat([Train_df,Train_dummy_df],axis=1)
Train_df2.head()

   age  owns_car  ...  occupation_type_Unknown  occupation_type_Waiters/barmen staff
0   46       0.0  ...                        1                                     0
1   29       0.0  ...                        0                                     0
2   37       0.0  ...                        0                                     0
3   39       0.0  ...                        0                                     0
4   46       1.0  ...                        0                                     0

[5 rows x 35 columns]

In [ ]:
features_list=list(Train_df2.columns)
features_list.remove('credit_card_default')

#Dataset Cleaning for Test set

In [ ]:
Test_df.head()

  customer_id  age gender  ... credit_score prev_defaults  default_in_last_6months
0  CST_142525   52      F  ...        779.0             0                        0
1  CST_129215   48      F  ...        806.0             0                        0
2  CST_138443   50      F  ...        528.0             2                        0
3  CST_123812   30      F  ...        815.0             0                        0
4  CST_144450   52      M  ...        613.0             1                        1

[5 rows x 17 columns]

In [ ]:
Test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11383 entries, 0 to 11382
Data columns (total 17 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   customer_id              11383 non-null  object
 1   age                      11383 non-null  int64
 2   gender                   11383 non-null  object
 3   owns_car                 11251 non-null  object
 4   owns_house               11383 non-null  object
 5   no_of_children           11193 non-null  float64
 6   net_yearly_income        11383 non-null  float64
 7   no_of_days_employed      11278 non-null  float64
 8   occupation_type          11383 non-null  object
 9   total_family_members     11352 non-null  float64
 10  migrant_worker           11357 non-null  float64
 11  yearly_debt_payments     11361 non-null  float64
 12  credit_limit             11383 non-null  float64
 13  credit_limit_used(%)     11383 non-null  int64
 14  credit_score             11380 non-null  float64
 15  prev_defaults            11383 non-null  int64
 16  default_in_last_6months  11383 non-null  int64
dtypes: float64(8), int64(4), object(5)
memory usage: 1.5+ MB

In [ ]:
Test_df.isnull().sum()

customer_id                  0
age                          0
gender                       0
owns_car                   132
owns_house                   0
no_of_children             190
net_yearly_income            0
no_of_days_employed        105
occupation_type              0
total_family_members        31
migrant_worker              26
yearly_debt_payments        22
credit_limit                 0
credit_limit_used(%)         0
credit_score                 3
prev_defaults                0
default_in_last_6months      0
dtype: int64

In [ ]:
Test_df['credit_score'].replace(np.NaN,Test_df['credit_score'].median(),inplace=True)
Test_df['owns_house'].replace({'Y':1,'N':0},inplace=True)
Test_df['owns_car'].replace({'Y':1,'N':0},inplace=True)

In [ ]:
Test_df.fillna(0,inplace=True)

In [ ]:
Test_df.isnull().sum()

customer_id                0
age                        0
gender                     0
owns_car                   0
owns_house                 0
no_of_children             0
net_yearly_income          0
no_of_days_employed        0
occupation_type            0
total_family_members       0
migrant_worker             0
yearly_debt_payments       0
credit_limit               0
credit_limit_used(%)       0
credit_score               0
prev_defaults              0
default_in_last_6months    0
dtype: int64

In [ ]:
Test_category_df=Test_df.select_dtypes(include=['object'])
Test_category_df

      customer_id gender occupation_type
0      CST_142525      F         Unknown
1      CST_129215      F         Unknown
2      CST_138443      F         Unknown
3      CST_123812      F        Laborers
4      CST_144450      M        Laborers
...           ...    ...             ...
11378  CST_142412      F     Sales staff
11379  CST_107967      F         Unknown
11380  CST_134002      M        Laborers
11381  CST_146856      F  Medicine staff
11382  CST_112001      F  Medicine staff

[11383 rows x 3 columns]

In [ ]:
Test_dummy_df=pd.get_dummies(Test_df[Test_category_df.keys()[1:]],drop_first=True,dtype=int)
len(Test_dummy_df.keys())

20

In [ ]:
Test_df.drop(columns=Test_category_df.keys()[1:],axis=1,inplace=True)

In [ ]:
Test_df2=pd.concat([Test_df,Test_dummy_df],axis=1)
Test_df2.head()

  customer_id  ...  occupation_type_Waiters/barmen staff
0  CST_142525  ...                                     0
1  CST_129215  ...                                     0
2  CST_138443  ...                                     0
3  CST_123812  ...                                     0
4  CST_144450  ...                                     0

[5 rows x 35 columns]

#Train-Test Split of features and target dataset

In [ ]:
from sklearn.preprocessing import StandardScaler
from keras.models import Sequential
from keras.layers import Dense

In [ ]:
X_train=Train_df2[features_list][:34145]
X_val=Train_df2[features_list][34145:]
y_train=Train_df2['credit_card_default'][:34145]
y_val=Train_df2['credit_card_default'][34145:]
X_test=Test_df2[features_list]

In [ ]:
print(X_train.shape)
print(y_train.shape)
print(X_val.shape)
print(y_val.shape)

(34145, 34)
(34145,)
(11383, 34)
(11383,)

In [ ]:
X_test.shape

(11383, 34)

In [ ]:
scale = StandardScaler()
X_train = scale.fit_transform(X_train)
X_val= scale.fit_transform(X_val)

In [ ]:
X_test=scale.fit_transform(X_test)

#Build model

In [ ]:
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
classifier = LogisticRegression(random_state =0)
classifier.fit(X_train, y_train)
y_pred = classifier.predict(X_test)
y_pred_val=classifier.predict(X_val)

print("f1_score\t:", 100*(metrics.f1_score(y_val,y_pred_val,average='macro')))
print("recall_score\t:",100*(metrics.recall_score(y_val,y_pred_val,average='macro')))
print("precision_score\t:",100*(metrics.precision_score(y_val,y_pred_val,average='macro')))

f1_score	: 92.86368882864913
recall_score	: 89.0884311045524
precision_score	: 97.66476913345983

In [ ]:
result=[]
for i in range(11383):
    id=Test_df2['customer_id'][i]
    result.append([id,y_pred[i]])

result_df=pd.DataFrame()
result_df['customer_id']=[i[0] for i in result]
result_df['credit_card_default']=[i[1] for i in result]
result_df.to_csv("result_LR.csv",index=False)
result_df.head()

  customer_id  credit_card_default
0  CST_142525                    0
1  CST_129215                    0
2  CST_138443                    1
3  CST_123812                    0
4  CST_144450                    1

#SVM

In [ ]:
from sklearn import svm
s = svm.SVC(kernel="linear")
s.fit(X_train,y_train)
y_pred_val=s.predict(X_val)
y_pred=s.predict(X_test)

print("SVM model accuracy(in %):", metrics.accuracy_score(y_val, y_pred)*100)

SVM model accuracy(in %): 86.68189405253447

In [ ]:
print("f1_score\t:", 100*(metrics.f1_score(y_val,y_pred_val,average='macro')))
print("recall_score\t:",100*(metrics.recall_score(y_val,y_pred_val,average='macro')))
print("precision_score\t:",100*(metrics.precision_score(y_val,y_pred_val,average='macro')))

f1_score	: 92.73724825603782
recall_score	: 88.14968814968816
precision_score	: 98.92947694619212

In [ ]:
result=[]
for i in range(11383):
    id=Test_df2['customer_id'][i]
    result.append([id,y_pred[i]])

result_df=pd.DataFrame()
result_df['customer_id']=[i[0] for i in result]
result_df['credit_card_default']=[i[1] for i in result]
result_df.to_csv("result_SVM.csv",index=False)
result_df.head()

  customer_id  credit_card_default
0  CST_142525                    0
1  CST_129215                    0
2  CST_138443                    1
3  CST_123812                    0
4  CST_144450                    1